Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/СравнениеСпецификаций/СравнениеСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СравнениеСпецификаций</name>
</mdclass:DataProcessor>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВариантыЗаполненияОбеспеченияПроизводства/ВариантыЗаполненияОбеспеченияПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗаполненияОбеспеченияПроизводства</name>
  <enumValues>
    <name>НеЗаполнять</name>
  </enumValues>
  <enumValues>
    <name>ПоСхемамОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ПоНастройкамПередачиВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПоНастройкамПередачиВПроизводствоДляПланов</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ТипыПроизводственныхПроцессов/ТипыПроизводственныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроизводственныхПроцессов</name>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Разборка</name>
  </enumValues>
  <enumValues>
    <name>БезСпецификаций</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ЭтапыПроизводства/ЭтапыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроизводства</name>
  <owners>Catalog.РесурсныеСпецификации</owners>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующегоЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуВидовРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДлительностиЭтапа</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительныйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершающийБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПредварительногоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗавершающегоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоНаСтороне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыПартнера</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЕдиницПартийИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемаяМощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДнейДоОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодходитНовойКонцепции</name>
    <comment>Служебный реквизит. Только для обновления ИБ.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаПереработчика</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаУслугиПереработчика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентМаршрутнойКарты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРаботыВидовРабочихЦентров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Занятость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтборСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтборЗначениеСвойства</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличества</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АльтернативныеВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиВидыРабочихЦентров</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтборСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтборЗначениеСвойства</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличества</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоСвойствам</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/СравнениеСпецификаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет сравнение нескольких ресурсных спецификаций.
//
// Параметры:
//  СписокСпецификаций	 - СписокЗначений	 - список сравниваемых спецификаций.
// 
// Возвращаемое значение:
//  Структура - структура результата сравнения.
//
Функция ВыполнитьСравнениеСпецификаций(СписокСпецификаций) Экспорт
	
	ДанныеСравнения = Новый Структура;
	ДанныеСравнения.Вставить("СписокЭтапов",    Новый СписокЗначений);
	ДанныеСравнения.Вставить("ДанныеСравнения", Новый Соответствие);
	
	ПолучитьДанныеСпецификаций(ДанныеСравнения, СписокСпецификаций);
	
	ОтметитьОтличия(ДанныеСравнения, СписокСпецификаций.Количество());
	
	Возврат ДанныеСравнения;
	
КонецФункции

// Выполняет сравнение изделия заказа на производство и ресурсной спецификации.
//
// Параметры:
//  ДанныеЗаказа	 - Структура		 - данные изделия, для которого происходит поиск спецификации для сравнения.
//  Этапы			 - ТаблицаЗначений	 - информация об этапах заказа на производство.
//  МатериалыИУслуги - ТаблицаЗначений	 - информация об материалах заказа на производство.
//  ВыходныеИзделия	 - ТаблицаЗначений	 - информация об выходных изделиях заказа на производство.
//  ВозвратныеОтходы - ТаблицаЗначений	 - информация о возвратных отходах заказа на производство.
//  ТаблицаВидыРЦ	 - ТаблицаЗначений	 - информация о видах рабочих центров.
// 
// Возвращаемое значение:
//  Структура - структура результата сравнения.
//
Функция ВыполнитьСравнениеЗаказаСоСпецификациями(ДанныеЗаказа, Этапы, МатериалыИУслуги, ВыходныеИзделия, ВозвратныеОтходы, ТаблицаВидыРЦ) Экспорт
	
	ДанныеСравнения = Новый Структура;
	ДанныеСравнения.Вставить("СписокЭтапов",    Новый СписокЗначений);
	ДанныеСравнения.Вставить("ДанныеСравнения", Новый Соответствие);
	
	СтрокиЭтапы = Этапы.НайтиСтроки(Новый Структура("КлючСвязиПродукция", ДанныеЗаказа.КлючСвязиПродукция));
	Для каждого ВыборкаЭтапов Из СтрокиЭтапы Цикл
		
		ОбъектСравнения = НСтр("ru = 'По заказу'");
		
		КлючЭтапа = Строка(ВыборкаЭтапов.КлючЭтапа);
		ВыборкаЭтапов.КлючЭтапа = КлючЭтапа;
		
		ПолеЗначения = "Значение1";
		
		СтрокаЭтап = ДанныеСравнения.СписокЭтапов.НайтиПоЗначению(КлючЭтапа);
		Если СтрокаЭтап = Неопределено Тогда
			ПредставлениеЭтапа = Строка(ВыборкаЭтапов.Этап) + " (" + ВыборкаЭтапов.СпецификацияПредставление + ")";
			ДанныеСравнения.СписокЭтапов.Добавить(КлючЭтапа, ПредставлениеЭтапа);
			
			ДанныеСравненияЭтапа = ДанныеДляСравненияКонструктор();
			
			ДанныеСравнения.ДанныеСравнения.Вставить(КлючЭтапа, ДанныеСравненияЭтапа);
			
			ДанныеСравненияЭтапа.СписокСпецификаций = Новый Массив;
		Иначе
			ДанныеСравненияЭтапа = ДанныеСравнения.ДанныеСравнения.Получить(КлючЭтапа);
		КонецЕсли; 
		
		ДанныеСравненияЭтапа.СписокСпецификаций.Добавить(ОбъектСравнения);
		
		ДобавитьСвойстваЭтапа(ВыборкаЭтапов, ДанныеСравненияЭтапа.ТаблицаСвойств, ПолеЗначения);
		
		// ВыходныеИзделия
		СтрокиВыходныеИзделия = ВыходныеИзделия.НайтиСтроки(Новый Структура("КлючСвязиЭтапы", ВыборкаЭтапов.КлючСвязи));
		ДобавитьДанныеПоНоменклатуре(СтрокиВыходныеИзделия, ДанныеСравненияЭтапа.ТаблицаИзделий, ПолеЗначения);
		
		// ВозвратныеОтходы
		СтрокиВозвратныеОтходы = ВозвратныеОтходы.НайтиСтроки(Новый Структура("КлючСвязиЭтапы", ВыборкаЭтапов.КлючСвязи));
		ДобавитьДанныеПоНоменклатуре(СтрокиВозвратныеОтходы, ДанныеСравненияЭтапа.ТаблицаОтходов, ПолеЗначения);
		
		// МатериалыИУслуги
		СтрокиМатериалыИУслуги = МатериалыИУслуги.НайтиСтроки(Новый Структура("КлючСвязиЭтапы", ВыборкаЭтапов.КлючСвязи));
		ДобавитьДанныеПоНоменклатуре(СтрокиМатериалыИУслуги, ДанныеСравненияЭтапа.ТаблицаМатериалов, ПолеЗначения);
		
		
	КонецЦикла;
	
	// Добавим данные по спецификации
	ПараметрыВыборки = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных(
		,
		,
		Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоНастройкамПередачиВПроизводство);
	ПараметрыВыборки.ПолучитьПредставления = Истина;
	ПараметрыВыборки.ОкруглятьКоличествоШтучныхТоваров = Ложь;
	
	СтруктураДанных = Справочники.РесурсныеСпецификации.ДанныеСпецификацииСПолуфабрикатами(ДанныеЗаказа, Ложь, ПараметрыВыборки);
	
	СтруктураДанных.Этапы.Колонки.Добавить("КлючЭтапа", Новый ОписаниеТипов("Строка"));
	СтруктураДанных.Этапы.Колонки.Добавить("СпецификацияПредставление", Новый ОписаниеТипов("Строка"));
	СтруктураДанных.МатериалыИУслуги.Колонки.Добавить("КлючЭтапа", Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ВыходныеИзделия.Колонки.Добавить("КлючЭтапа", Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ВозвратныеОтходы.Колонки.Добавить("КлючЭтапа", Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Этапы.Этап КАК Этап
	|ПОМЕСТИТЬ ВТЭтапы
	|ИЗ
	|	&Этапы КАК Этапы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТЭтапы.Этап КАК Этап,
	|	ВТЭтапы.Этап.Владелец.Представление КАК СпецификацияПредставление,
	|	ВТЭтапы.Этап.Владелец.Код КАК КодСпецификации
	|ИЗ
	|	ВТЭтапы КАК ВТЭтапы");
	
	Запрос.УстановитьПараметр("Этапы", СтруктураДанных.Этапы);
	ДанныеЭтапов = Запрос.Выполнить().Выбрать();
	СтруктураОтбора = Новый Структура("Этап");
	
	Для каждого ЭлКоллекции Из СтруктураДанных.Этапы Цикл
		
		СтруктураОтбора.Этап = ЭлКоллекции.Этап;
		ДанныеЭтапов.НайтиСледующий(СтруктураОтбора);
		ЭлКоллекции.КлючЭтапа = Строка(ЭлКоллекции.Этап.УникальныйИдентификатор())+ "_" + ДанныеЭтапов.КодСпецификации;
		ЭлКоллекции.СпецификацияПредставление = ДанныеЭтапов.СпецификацияПредставление;
		ДанныеЭтапов.Сбросить();
		
	КонецЦикла;
	
	Для каждого ЭлКоллекции Из СтруктураДанных.МатериалыИУслуги Цикл
		СтруктураОтбора.Этап = ЭлКоллекции.Этап;
		ДанныеЭтапов.НайтиСледующий(СтруктураОтбора);
		ЭлКоллекции.КлючЭтапа = Строка(ЭлКоллекции.Этап.УникальныйИдентификатор())+ "_" + ДанныеЭтапов.КодСпецификации;
		ДанныеЭтапов.Сбросить();
	КонецЦикла;
	Для каждого ЭлКоллекции Из СтруктураДанных.ВыходныеИзделия Цикл
		СтруктураОтбора.Этап = ЭлКоллекции.Этап;
		ДанныеЭтапов.НайтиСледующий(СтруктураОтбора);
		ЭлКоллекции.КлючЭтапа = Строка(ЭлКоллекции.Этап.УникальныйИдентификатор())+ "_" + ДанныеЭтапов.КодСпецификации;
		ДанныеЭтапов.Сбросить();
	КонецЦикла;
	Для каждого ЭлКоллекции Из СтруктураДанных.ВозвратныеОтходы Цикл
		СтруктураОтбора.Этап = ЭлКоллекции.Этап;
		ДанныеЭтапов.НайтиСледующий(СтруктураОтбора);
		ЭлКоллекции.КлючЭтапа = Строка(ЭлКоллекции.Этап.УникальныйИдентификатор())+ "_" + ДанныеЭтапов.КодСпецификации;
		ДанныеЭтапов.Сбросить();
	КонецЦикла;
	Для каждого ВыборкаЭтапов Из СтруктураДанных.Этапы Цикл
		
		ОбъектСравнения = ДанныеЗаказа.Спецификация;
		
		КлючЭтапа = Строка(ВыборкаЭтапов.КлючЭтапа);
		ВыборкаЭтапов.КлючЭтапа = КлючЭтапа;
		
		ПолеЗначения = "Значение";
		
		СтрокаЭтап = ДанныеСравнения.СписокЭтапов.НайтиПоЗначению(КлючЭтапа);
		Если СтрокаЭтап = Неопределено Тогда
			
			ПредставлениеЭтапа = Строка(ВыборкаЭтапов.Этап) + " (" + ВыборкаЭтапов.СпецификацияПредставление + ")";
			ДанныеСравнения.СписокЭтапов.Добавить(КлючЭтапа, ПредставлениеЭтапа);
			
			ДанныеСравненияЭтапа = ДанныеДляСравненияКонструктор();
			
			ДанныеСравнения.ДанныеСравнения.Вставить(КлючЭтапа, ДанныеСравненияЭтапа);
			
			ДанныеСравненияЭтапа.СписокСпецификаций = Новый Массив;
		Иначе
			ДанныеСравненияЭтапа = ДанныеСравнения.ДанныеСравнения.Получить(КлючЭтапа);
		КонецЕсли; 
		
		ДанныеСравненияЭтапа.СписокСпецификаций.Добавить(ОбъектСравнения);
		
		ДобавитьСвойстваЭтапа(ВыборкаЭтапов, ДанныеСравненияЭтапа.ТаблицаСвойств, ПолеЗначения);
		
		// ВыходныеИзделия
		СтрокиВыходныеИзделия = СтруктураДанных.ВыходныеИзделия.НайтиСтроки(Новый Структура("КлючЭтапа", ВыборкаЭтапов.КлючЭтапа));
		ДобавитьДанныеПоНоменклатуре(СтрокиВыходныеИзделия, ДанныеСравненияЭтапа.ТаблицаИзделий, ПолеЗначения);
		
		// ВозвратныеОтходы
		СтрокиВозвратныеОтходы = СтруктураДанных.ВозвратныеОтходы.НайтиСтроки(Новый Структура("КлючЭтапа", ВыборкаЭтапов.КлючЭтапа));
		ДобавитьДанныеПоНоменклатуре(СтрокиВозвратныеОтходы, ДанныеСравненияЭтапа.ТаблицаОтходов, ПолеЗначения);
		
		// МатериалыИУслуги
		СтрокиМатериалыИУслуги = СтруктураДанных.МатериалыИУслуги.НайтиСтроки(Новый Структура("КлючЭтапа", ВыборкаЭтапов.КлючЭтапа));
		ДобавитьДанныеПоНоменклатуре(СтрокиМатериалыИУслуги, ДанныеСравненияЭтапа.ТаблицаМатериалов, ПолеЗначения);
		
		
	КонецЦикла;
	
	ОтметитьОтличия(ДанныеСравнения, 2);
	
	Возврат ДанныеСравнения;
	
КонецФункции

// Настраивает макет для отчета о сравнении спецификаций.
//
// Параметры:
//  РезультатСравнения	 - ТабличныйДокумент - для вывода результата сравнения.
//  ЕстьОтличия			 - Булево			 - флаг наличия отличий.
//
Процедура ЗавершитьВыводОтчета(РезультатСравнения, ЕстьОтличия) Экспорт
	
	Если ЕстьОтличия Тогда
		Возврат;
	КонецЕсли;
	
	МакетОтчета = Обработки.СравнениеСпецификаций.ПолучитьМакет("Макет");
	
	ОбластьСтрокаНетОтличий = МакетОтчета.ПолучитьОбласть("СтрокаНетОтличий");
	
	РезультатСравнения.Вывести(ОбластьСтрокаНетОтличий);
	
КонецПроцедуры

// Выводит результат сравнения в табличный документ.
//
// Параметры:
//  РезультатСравнения		 - ТабличныйДокумент - для вывода результата сравнения.
//  СписокСпецификаций		 - СписокЗначений	 - список сравниваемых спецификаций.
//  ПоказатьТолькоОтличия	 - Булево			 - если Истина, то выводятся только отличия.
//  ДанныеСравнения			 - Структура		 - результат сравнения.
//  ЗаголовокОтчета			 - Строка			 - Заголовок отчета.
//  СтрокаЗаказа			 - Число			 - Строка заказа, если в сравнении присутствует заказ на производство.
// 
// Возвращаемое значение:
//  Булево - Истина, если есть отличия.
//
Функция ВывестиОтчет(
		РезультатСравнения, 
		СписокСпецификаций, 
		ПоказатьТолькоОтличия, 
		ДанныеСравнения, 
		ЗаголовокОтчета = Неопределено, 
		СтрокаЗаказа = Неопределено) Экспорт
	
	МакетОтчета = Обработки.СравнениеСпецификаций.ПолучитьМакет("Макет");
	
	// Заголовок отчета
	Если ЗаголовокОтчета = Неопределено Тогда
		ЗаголовокОтчета = НСтр("ru = 'Сравнение спецификаций'");
	КонецЕсли;
	ОбластьЗаголовок = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
	РезультатСравнения.Вывести(ОбластьЗаголовок);
	
	Если СтрокаЗаказа <> Неопределено Тогда
		
		Если ПоказатьТолькоОтличия Тогда
			ЕстьОтличия = Ложь;
			Для каждого ДанныеЭтапа Из ДанныеСравнения.СписокЭтапов Цикл
				
				ДанныеСравненияЭтапа = ДанныеСравнения.ДанныеСравнения.Получить(ДанныеЭтапа.Значение);
				
				Если ДанныеСравненияЭтапа.СписокСпецификаций.Количество() <> СписокСпецификаций.Количество() 
					ИЛИ ДанныеСравненияЭтапа.ТаблицаСвойств.Найти(Истина, "ЕстьОтличия") <> Неопределено 
					ИЛИ ДанныеСравненияЭтапа.ТаблицаИзделий.Найти(Истина, "ЕстьОтличия") <> Неопределено 
					ИЛИ ДанныеСравненияЭтапа.ТаблицаОтходов.Найти(Истина, "ЕстьОтличия") <> Неопределено 
					ИЛИ ДанныеСравненияЭтапа.ТаблицаВходящихИзделий.Найти(Истина, "ЕстьОтличия") <> Неопределено 
					ИЛИ ДанныеСравненияЭтапа.ТаблицаМатериалов.Найти(Истина, "ЕстьОтличия") <> Неопределено
					ИЛИ ДанныеСравненияЭтапа.ТаблицаТрудозатрат.Найти(Истина, "ЕстьОтличия") <> Неопределено
					Тогда
					
					ЕстьОтличия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ЕстьОтличия Тогда
				Возврат Ложь;
			КонецЕсли; 
		КонецЕсли;
		
		ОбластьСтрокаЗаказа = МакетОтчета.ПолучитьОбласть("СтрокаЗаказа");
		ОбластьСтрокаЗаказа.Параметры.СтрокаЗаказа = СтрокаЗаказа;
		РезультатСравнения.Вывести(ОбластьСтрокаЗаказа);
		РезультатСравнения.НачатьГруппуСтрок("СтрокаЗаказа");
	КонецЕсли;
	
	// Область "Шапка"
	ОбластьШапкаНазвание = МакетОтчета.ПолучитьОбласть("Шапка|НазванияСвойств");
	ОбластьШапкаИсточник = МакетОтчета.ПолучитьОбласть("Шапка|СвойстваИсточник");
	
	// Область "Этап"
	ОбластьЭтапНазвание = МакетОтчета.ПолучитьОбласть("Этап|НазванияСвойств");
	ОбластьЭтапИсточник = МакетОтчета.ПолучитьОбласть("Этап|СвойстваИсточник");
	
	// Область "ГруппаСвойств"
	ОбластьГруппаСвойствНазвание = МакетОтчета.ПолучитьОбласть("ГруппаСвойств|НазванияСвойств");
	ОбластьГруппаСвойствИсточник = МакетОтчета.ПолучитьОбласть("ГруппаСвойств|СвойстваИсточник");
	
	// Область "СвойстваСтрока"
	ОбластьСвойстваСтрокаНазвание = МакетОтчета.ПолучитьОбласть("СвойстваСтрока|НазванияСвойств");
	ОбластьСвойстваСтрокаИсточник = МакетОтчета.ПолучитьОбласть("СвойстваСтрока|СвойстваИсточник");
	
	//////////////////////////////////////
	// ВЫВОД ОТЧЕТА
	
	// Выводим реквизиты спецификаций
	СтруктураСравненияДанных = ДанныеСравнения.ДанныеСравнения.Получить(КлючРеквизитыСпецификаций());
	Если СтруктураСравненияДанных <> Неопределено
		И ЗначениеЗаполнено(СтруктураСравненияДанных.ТаблицаРеквизитов) Тогда
		
		Если (ПоказатьТолькоОтличия И СтруктураСравненияДанных.ТаблицаРеквизитов.Найти(Истина, "ЕстьОтличия") <> Неопределено
			ИЛИ Не ПоказатьТолькоОтличия) Тогда
			
			ОбластьШапкаНазвание.Параметры.Заголовок = НСтр("ru = 'Реквизиты'");
			РезультатСравнения.Вывести(ОбластьШапкаНазвание);
			Для каждого ЭлКоллекции Из СписокСпецификаций Цикл
				ОбластьШапкаИсточник.Параметры.ИмяИсточника         = ЭлКоллекции.Представление;
				ОбластьШапкаИсточник.Параметры.РасшифровкаИсточника = ЭлКоллекции.Значение;
				РезультатСравнения.Присоединить(ОбластьШапкаИсточник);
			КонецЦикла;
			
			ВывестиСписокСвойств(СтруктураСравненияДанных.ТаблицаРеквизитов, 
									ОбластьСвойстваСтрокаНазвание,
									ОбластьСвойстваСтрокаИсточник,
									РезультатСравнения,
									СписокСпецификаций,
									ПоказатьТолькоОтличия);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьОтличия = Ложь;
	ШапкаЭтаповВыведена = Ложь;
	
	// Выводим данные этапов
	Для каждого ДанныеЭтапа Из ДанныеСравнения.СписокЭтапов Цикл
		
		ДанныеСравненияЭтапа = ДанныеСравнения.ДанныеСравнения.Получить(ДанныеЭтапа.Значение);
		
		// Этап не нужно выводить если:
		// - нужно показать только отличия
		// - у всех спецификаций есть этап
		// - нет различия в свойствах.
		Если ПоказатьТолькоОтличия 
			И ДанныеСравненияЭтапа.СписокСпецификаций.Количество() = СписокСпецификаций.Количество()
			И ДанныеСравненияЭтапа.ТаблицаСвойств.Найти(Истина, "ЕстьОтличия") = Неопределено
			И ДанныеСравненияЭтапа.ТаблицаИзделий.Найти(Истина, "ЕстьОтличия") = Неопределено
			И ДанныеСравненияЭтапа.ТаблицаОтходов.Найти(Истина, "ЕстьОтличия") = Неопределено
			И ДанныеСравненияЭтапа.ТаблицаВходящихИзделий.Найти(Истина, "ЕстьОтличия") = Неопределено
			И ДанныеСравненияЭтапа.ТаблицаМатериалов.Найти(Истина, "ЕстьОтличия") = Неопределено
			И ДанныеСравненияЭтапа.ТаблицаТрудозатрат.Найти(Истина, "ЕстьОтличия") = Неопределено
			Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ ШапкаЭтаповВыведена Тогда
			// Выведем шапку раздела "Этапы" отчета
			ОбластьШапкаНазвание.Параметры.Заголовок = НСтр("ru = 'Этапы'");
			РезультатСравнения.Вывести(ОбластьШапкаНазвание);
			Для каждого ЭлКоллекции Из СписокСпецификаций Цикл
				ОбластьШапкаИсточник.Параметры.ИмяИсточника         = ЭлКоллекции.Представление;
				ОбластьШапкаИсточник.Параметры.РасшифровкаИсточника = ЭлКоллекции.Значение;
				РезультатСравнения.Присоединить(ОбластьШапкаИсточник);
			КонецЦикла;
			
			ШапкаЭтаповВыведена = Истина;
		КонецЕсли; 
		
		ЕстьОтличия = Истина;
		
		// Этап
		ОбластьЭтапНазвание.Параметры.Этап = ДанныеЭтапа.Представление;
		РезультатСравнения.Вывести(ОбластьЭтапНазвание, 2, "Этап");
		Для каждого ЭлКоллекции Из СписокСпецификаций Цикл
			ОбластьИсточник = РезультатСравнения.Присоединить(ОбластьЭтапИсточник);
			
			Если ДанныеСравненияЭтапа.СписокСпецификаций.Найти(ЭлКоллекции.Значение) = Неопределено Тогда
				ОбластьИсточник.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
				ОбластьИсточник.Текст = НСтр("ru = '<Отсутствует>'");
			КонецЕсли;
		КонецЦикла;
		ОбластьИсточник.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		
		Если ДанныеСравненияЭтапа.СписокСпецификаций.Количество() < 2 Тогда
			// Не выводим свойства, если этот этап только у одной спецификации
			Продолжить;
		КонецЕсли; 
		
		РезультатСравнения.НачатьГруппуСтрок("Этап");
		
		ВывестиГруппуСвойств(НСтр("ru = 'Свойства'"),
							ДанныеСравненияЭтапа.ТаблицаСвойств, 
							ОбластьГруппаСвойствНазвание, 
							ОбластьГруппаСвойствИсточник, 
							ОбластьСвойстваСтрокаНазвание, 
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
		
		ВывестиГруппуСвойств(Метаданные.Справочники.РесурсныеСпецификации.ТабличныеЧасти.ВыходныеИзделия.Синоним,
							ДанныеСравненияЭтапа.ТаблицаИзделий, 
							ОбластьГруппаСвойствНазвание, 
							ОбластьГруппаСвойствИсточник, 
							ОбластьСвойстваСтрокаНазвание, 
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
							
		ВывестиГруппуСвойств(Метаданные.Справочники.РесурсныеСпецификации.ТабличныеЧасти.ВозвратныеОтходы.Синоним,
							ДанныеСравненияЭтапа.ТаблицаОтходов, 
							ОбластьГруппаСвойствНазвание, 
							ОбластьГруппаСвойствИсточник, 
							ОбластьСвойстваСтрокаНазвание, 
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
			
		ВывестиГруппуСвойств(НСтр("ru = 'Разбираемые изделия'"),
							ДанныеСравненияЭтапа.ТаблицаВходящихИзделий, 
							ОбластьГруппаСвойствНазвание, 
							ОбластьГруппаСвойствИсточник, 
							ОбластьСвойстваСтрокаНазвание, 
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
		
		ВывестиГруппуСвойств(Метаданные.Справочники.РесурсныеСпецификации.ТабличныеЧасти.МатериалыИУслуги.Синоним,
							ДанныеСравненияЭтапа.ТаблицаМатериалов, 
							ОбластьГруппаСвойствНазвание, 
							ОбластьГруппаСвойствИсточник, 
							ОбластьСвойстваСтрокаНазвание, 
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
		
		ВывестиГруппуСвойств(Метаданные.Справочники.РесурсныеСпецификации.ТабличныеЧасти.Трудозатраты.Синоним,
							ДанныеСравненияЭтапа.ТаблицаТрудозатрат,
							ОбластьГруппаСвойствНазвание,
							ОбластьГруппаСвойствИсточник,
							ОбластьСвойстваСтрокаНазвание,
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
		
		
		РезультатСравнения.ЗакончитьГруппуСтрок();
	КонецЦикла; 
	
	Если СтрокаЗаказа <> Неопределено Тогда
		РезультатСравнения.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	Возврат ЕстьОтличия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтметитьОтличия(ДанныеСравнения, КоличествоИсточников)
	
	Для каждого ЭлДанныеСравненияЭтапа Из ДанныеСравнения.ДанныеСравнения Цикл
		
		ДанныеСравненияЭтапа = ЭлДанныеСравненияЭтапа.Значение;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаРеквизитов Цикл
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаСвойств Цикл
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаМатериалов Цикл
			Если ДанныеСвойства.Значения.Количество() <> КоличествоИсточников Тогда
				ДанныеСвойства.ЕстьОтличия = Истина;
				Продолжить;
			КонецЕсли;
			
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаВходящихИзделий Цикл
			Если ДанныеСвойства.Значения.Количество() <> КоличествоИсточников Тогда
				ДанныеСвойства.ЕстьОтличия = Истина;
				Продолжить;
			КонецЕсли;
			
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаИзделий Цикл
			Если ДанныеСвойства.Значения.Количество() <> КоличествоИсточников Тогда
				ДанныеСвойства.ЕстьОтличия = Истина;
				Продолжить;
			КонецЕсли;
			
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаОтходов Цикл
			Если ДанныеСвойства.Значения.Количество() <> КоличествоИсточников Тогда
				ДанныеСвойства.ЕстьОтличия = Истина;
				Продолжить;
			КонецЕсли;
			
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого ДанныеСвойства Из ДанныеСравненияЭтапа.ТаблицаТрудозатрат Цикл
			Если ДанныеСвойства.Значения.Количество() <> КоличествоИсточников Тогда
				ДанныеСвойства.ЕстьОтличия = Истина;
				Продолжить;
			КонецЕсли;
			
			Для каждого элЗначение1 Из ДанныеСвойства.Значения Цикл
				Для каждого элЗначение2 Из ДанныеСвойства.Значения Цикл
					Если элЗначение1.Значение <> элЗначение2.Значение Тогда
						ДанныеСвойства.ЕстьОтличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ДанныеСвойства.ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

Функция ДанныеДляСравненияКонструктор()
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("Свойство",    Новый ОписаниеТипов("Строка"));
	ТаблицаРеквизитов.Колонки.Добавить("Значения",    Новый ОписаниеТипов("Структура"));
	ТаблицаРеквизитов.Колонки.Добавить("ЕстьОтличия", Новый ОписаниеТипов("Булево"));
	
	ТаблицаСвойств = Новый ТаблицаЗначений;
	ТаблицаСвойств.Колонки.Добавить("Свойство",    Новый ОписаниеТипов("Строка"));
	ТаблицаСвойств.Колонки.Добавить("Значения",    Новый ОписаниеТипов("Структура"));
	ТаблицаСвойств.Колонки.Добавить("ЕстьОтличия", Новый ОписаниеТипов("Булево"));
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Свойство",       Новый ОписаниеТипов("Строка"));
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМатериалов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаМатериалов.Колонки.Добавить("Значения",       Новый ОписаниеТипов("Структура"));
	ТаблицаМатериалов.Колонки.Добавить("ЕстьОтличия",    Новый ОписаниеТипов("Булево"));
	
	ТаблицаВходящихИзделий = Новый ТаблицаЗначений;
	ТаблицаВходящихИзделий.Колонки.Добавить("Свойство",       Новый ОписаниеТипов("Строка"));
	ТаблицаВходящихИзделий.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаВходящихИзделий.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаВходящихИзделий.Колонки.Добавить("Значения",       Новый ОписаниеТипов("Структура"));
	ТаблицаВходящихИзделий.Колонки.Добавить("ЕстьОтличия",    Новый ОписаниеТипов("Булево"));
	
	ТаблицаИзделий = Новый ТаблицаЗначений;
	ТаблицаИзделий.Колонки.Добавить("Свойство",       Новый ОписаниеТипов("Строка"));
	ТаблицаИзделий.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИзделий.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаИзделий.Колонки.Добавить("Значения",       Новый ОписаниеТипов("Структура"));
	ТаблицаИзделий.Колонки.Добавить("ЕстьОтличия",    Новый ОписаниеТипов("Булево"));
	
	ТаблицаОтходов = Новый ТаблицаЗначений;
	ТаблицаОтходов.Колонки.Добавить("Свойство",       Новый ОписаниеТипов("Строка"));
	ТаблицаОтходов.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОтходов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаОтходов.Колонки.Добавить("Значения",       Новый ОписаниеТипов("Структура"));
	ТаблицаОтходов.Колонки.Добавить("ЕстьОтличия",    Новый ОписаниеТипов("Булево"));
	
	ТаблицаТрудозатрат = Новый ТаблицаЗначений;
	ТаблицаТрудозатрат.Колонки.Добавить("Свойство",    Новый ОписаниеТипов("Строка"));
	ТаблицаТрудозатрат.Колонки.Добавить("ВидРабот",    Новый ОписаниеТипов("СправочникСсылка.ВидыРаботСотрудников"));
	ТаблицаТрудозатрат.Колонки.Добавить("Значения",    Новый ОписаниеТипов("Структура"));
	ТаблицаТрудозатрат.Колонки.Добавить("ЕстьОтличия", Новый ОписаниеТипов("Булево"));

	
	ДанныеСравнения = Новый Структура;
	ДанныеСравнения.Вставить("СписокСпецификаций");
	ДанныеСравнения.Вставить("ТаблицаРеквизитов",      ТаблицаРеквизитов);
	ДанныеСравнения.Вставить("ТаблицаСвойств",         ТаблицаСвойств);
	ДанныеСравнения.Вставить("ТаблицаМатериалов",      ТаблицаМатериалов);
	ДанныеСравнения.Вставить("ТаблицаВходящихИзделий", ТаблицаВходящихИзделий);
	ДанныеСравнения.Вставить("ТаблицаИзделий",         ТаблицаИзделий);
	ДанныеСравнения.Вставить("ТаблицаОтходов",         ТаблицаОтходов);
	ДанныеСравнения.Вставить("ТаблицаТрудозатрат",     ТаблицаТрудозатрат);
	
	Возврат ДанныеСравнения;
	
КонецФункции


Процедура ДобавитьРеквизитыСпецификации(Реквизиты, ТаблицаРеквизитов, ПолеЗначения)
	
	
КонецПроцедуры

Функция ДобавитьСвойство(ИмяСвойства, Значение, ТаблицаСвойств, ПолеЗначения)
	
	НайденныеСтроки = ТаблицаСвойств.НайтиСтроки(Новый Структура("Свойство", ИмяСвойства));
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаСвойства = ТаблицаСвойств.Добавить();
		СтрокаСвойства.Свойство = ИмяСвойства;
		СтрокаСвойства.Значения = Новый Структура;
	Иначе
		СтрокаСвойства = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаСвойства.Значения.Вставить(ПолеЗначения, Значение);
	
	Возврат СтрокаСвойства;
	
КонецФункции

Процедура ДобавитьСвойстваЭтапа(ДанныеЭтапа, ТаблицаСвойств, ПолеЗначения)
	
	// Свойства
	ДобавитьСвойство(НСтр("ru = 'N этапа'"),       ДанныеЭтапа.НомерЭтапа,                 ТаблицаСвойств, ПолеЗначения);
	ДобавитьСвойство(НСтр("ru = 'N след. этапа'"), ДанныеЭтапа.НомерСледующегоЭтапа,       ТаблицаСвойств, ПолеЗначения);
	ДобавитьСвойство(НСтр("ru = 'Подразделение'"), ДанныеЭтапа.ПодразделениеПредставление, ТаблицаСвойств, ПолеЗначения);
	
	
	Если ДанныеЭтапа.ПланироватьРаботуВидовРабочихЦентров Тогда
	Иначе
		ДобавитьСвойство(НСтр("ru = 'Длительность этапа'"), 
						Строка(ДанныеЭтапа.ДлительностьЭтапа) + " (" + Перечисления.ЕдиницыИзмеренияВремени.День + ")",
						ТаблицаСвойств,
						ПолеЗначения);
	КонецЕсли; 
	
	ДобавитьСвойство(НСтр("ru = 'Описание'"), ДанныеЭтапа.Описание, ТаблицаСвойств, ПолеЗначения);
	
КонецПроцедуры

Процедура ДобавитьДанныеПоНоменклатуре(КоллекцияСтрокТЧ, ДанныеТЧ, ПолеЗначения)
	
	Для каждого ЭлКоллекции Из КоллекцияСтрокТЧ Цикл
		НайденныеСтроки = ДанныеТЧ.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", ЭлКоллекции.Номенклатура, ЭлКоллекции.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТЧ = ДанныеТЧ.Добавить();
			СтрокаТЧ.Номенклатура   = ЭлКоллекции.Номенклатура;
			СтрокаТЧ.Характеристика = ЭлКоллекции.Характеристика;
			СтрокаТЧ.Свойство = ЭлКоллекции.НоменклатураПредставление + ?(ЗначениеЗаполнено(ЭлКоллекции.ХарактеристикаПредставление), "," + ЭлКоллекции.ХарактеристикаПредставление, "");
			СтрокаТЧ.Значения = Новый Структура;
		Иначе
			СтрокаТЧ = НайденныеСтроки[0];
		КонецЕсли;
		
		СтрокаТЧ.Значения.Вставить(ПолеЗначения, Строка(ЭлКоллекции.КоличествоУпаковок) + " (" + ЭлКоллекции.ЕдИзм + ")");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеПоТрудозатратам(КоллекцияСтрокТЧ, ДанныеТЧ, ПолеЗначения)
	
	Для каждого ЭлКоллекции Из КоллекцияСтрокТЧ Цикл
		
		НайденныеСтроки = ДанныеТЧ.НайтиСтроки(Новый Структура("ВидРабот", ЭлКоллекции.ВидРабот));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТЧ = ДанныеТЧ.Добавить();
			СтрокаТЧ.ВидРабот = ЭлКоллекции.ВидРабот;
			СтрокаТЧ.Свойство = ЭлКоллекции.ВидРаботПредставление;
			СтрокаТЧ.Значения = Новый Структура;
		Иначе
			СтрокаТЧ = НайденныеСтроки[0];
		КонецЕсли;
		
		СтрокаТЧ.Значения.Вставить(ПолеЗначения, Формат(ЭлКоллекции.Количество, "ЧН=; ЧГ="));
	КонецЦикла;
	
КонецПроцедуры


Процедура ПолучитьДанныеСпецификаций(ДанныеСравнения, СписокСпецификаций)
	
	// Получим данные
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СписокЭтапов.Владелец КАК Владелец,
	|	МАКСИМУМ(СписокЭтапов.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВтСписокПервыхЭтаповСпецификаций
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК СписокЭтапов
	|ГДЕ
	|	СписокЭтапов.Владелец В(&СписокСпецификаций)
	|	И НЕ СписокЭтапов.ПометкаУдаления
	|	И (СписокЭтапов.НомерЭтапа = 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокЭтапов.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Спецификация,
	|	Реквизиты.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	Реквизиты.ВыпускПроизвольнымиПорциями КАК ВыпускПроизвольнымиПорциями,
	|	Реквизиты.ОптимальнаяПартияВыпуска КАК ОптимальнаяПартияВыпуска,
	|	Реквизиты.МинимальнаяПартияВыпуска КАК МинимальнаяПартияВыпуска,
	|	Реквизиты.ОграниченСрокПролеживанияВыходныхИзделий КАК ОграниченСрокПролеживанияВыходныхИзделий,
	|	Реквизиты.МаксимальныйСрокПролеживанияВыходныхИзделий КАК МаксимальныйСрокПролеживанияВыходныхИзделий
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка В(&СписокСпецификаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Этапы.Владелец КАК Спецификация,
	|	Этапы.Владелец.МногоэтапныйПроизводственныйПроцесс КАК Многоэтапный,
	|	Этапы.Владелец.Представление КАК СпецификацияПредставление,
	|	Этапы.Наименование КАК КлючЭтапа,
	|	Этапы.НомерЭтапа КАК НомерЭтапа,
	|	Этапы.НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
	|	ЕСТЬNULL(Этапы.Подразделение.Представление, """") КАК ПодразделениеПредставление,
	|	Этапы.ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий КАК ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий,
	|	Этапы.ПланироватьРаботуВидовРабочихЦентров КАК ПланироватьРаботуВидовРабочихЦентров,
	|	Этапы.ДлительностьЭтапа КАК ДлительностьЭтапа,
	|	Этапы.ПредварительныйБуфер КАК ПредварительныйБуфер,
	|	Этапы.ЗавершающийБуфер КАК ЗавершающийБуфер,
	|	Этапы.ЕдиницаИзмеренияПредварительногоБуфера КАК ЕдиницаИзмеренияПредварительногоБуфера,
	|	Этапы.ЕдиницаИзмеренияЗавершающегоБуфера КАК ЕдиницаИзмеренияЗавершающегоБуфера,
	|	Этапы.Непрерывный КАК Непрерывный,
	|	Этапы.Описание КАК Описание
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК Этапы
	|ГДЕ
	|	НЕ Этапы.ПометкаУдаления
	|	И Этапы.Владелец В(&СписокСпецификаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЭтапа,
	|	НомерСледующегоЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка КАК Спецификация,
	|	ДанныеТЧ.Этап.Наименование КАК КлючЭтапа,
	|	ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ДанныеТЧ.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ДанныеТЧ.Упаковка.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеТЧ.Номенклатура.ЕдиницаИзмерения.Представление, """")
	|	КОНЕЦ КАК ЕдИзм,
	|	ДанныеТЧ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДанныеТЧ.ДоляСтоимости КАК ДоляСтоимости,
	|	ЕСТЬNULL(ДанныеТЧ.Номенклатура.Представление, """") КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ДанныеТЧ.Характеристика.Представление, """") КАК ХарактеристикаПредставление
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ДанныеТЧ
	|ГДЕ
	|	ДанныеТЧ.Ссылка В(&СписокСпецификаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка КАК Спецификация,
	|	ДанныеТЧ.Этап.Наименование КАК КлючЭтапа,
	|	ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ДанныеТЧ.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ДанныеТЧ.Упаковка.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеТЧ.Номенклатура.ЕдиницаИзмерения.Представление, """")
	|	КОНЕЦ КАК ЕдИзм,
	|	ДанныеТЧ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДанныеТЧ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ЕСТЬNULL(ДанныеТЧ.Номенклатура.Представление, """") КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ДанныеТЧ.Характеристика.Представление, """") КАК ХарактеристикаПредставление
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК ДанныеТЧ
	|ГДЕ
	|	ДанныеТЧ.Ссылка В(&СписокСпецификаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка КАК Спецификация,
	|	ЕСТЬNULL(СписокПервыхЭтапов.Ссылка.Наименование, """") КАК КлючЭтапа,
	|	ДанныеТЧ.НоменклатураВходящегоИзделия КАК Номенклатура,
	|	ДанныеТЧ.ХарактеристикаВходящегоИзделия КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.УпаковкаВходящегоИзделия <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ДанныеТЧ.УпаковкаВходящегоИзделия.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеТЧ.НоменклатураВходящегоИзделия.ЕдиницаИзмерения.Представление, """")
	|	КОНЕЦ КАК ЕдИзм,
	|	ДанныеТЧ.КоличествоУпаковокВходящегоИзделия КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ДанныеТЧ.НоменклатураВходящегоИзделия.Представление, """") КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ДанныеТЧ.ХарактеристикаВходящегоИзделия.Представление, """") КАК ХарактеристикаПредставление
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК ДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСписокПервыхЭтаповСпецификаций КАК СписокПервыхЭтапов
	|		ПО ДанныеТЧ.Ссылка = СписокПервыхЭтапов.Владелец
	|ГДЕ
	|	ДанныеТЧ.Ссылка В(&СписокСпецификаций)
	|	И ДанныеТЧ.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка КАК Спецификация,
	|	ДанныеТЧ.Этап.Наименование КАК КлючЭтапа,
	|	ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ДанныеТЧ.Номенклатура.Представление, """") КАК НоменклатураПредставление,
	|	ДанныеТЧ.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ДанныеТЧ.Характеристика.Представление, """") КАК ХарактеристикаПредставление,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ДанныеТЧ.Упаковка.Представление, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеТЧ.Номенклатура.ЕдиницаИзмерения.Представление, """")
	|	КОНЕЦ КАК ЕдИзм,
	|	ДанныеТЧ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДанныеТЧ.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
	|	ДанныеТЧ.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
	|	ДанныеТЧ.СтатьяКалькуляции КАК СтатьяКалькуляции
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК ДанныеТЧ
	|ГДЕ
	|	ДанныеТЧ.Ссылка В(&СписокСпецификаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Ссылка КАК Спецификация,
	|	ДанныеТЧ.Этап.Наименование КАК КлючЭтапа,
	|	ДанныеТЧ.ВидРабот КАК ВидРабот,
	|	ЕСТЬNULL(ДанныеТЧ.ВидРабот.Представление, """") КАК ВидРаботПредставление,
	|	ДанныеТЧ.Количество КАК Количество,
	|	ДанныеТЧ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДанныеТЧ.НазначениеРабот КАК НазначениеРабот
	|ИЗ
	|	Справочник.РесурсныеСпецификации.Трудозатраты КАК ДанныеТЧ
	|ГДЕ
	|	ДанныеТЧ.Ссылка В(&СписокСпецификаций)
	|");
	
	Запрос.УстановитьПараметр("СписокСпецификаций", СписокСпецификаций);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	// реквизиты спецификаций
	
	ВыборкаРеквизитов = Результат[1].Выбрать();
	
	ДанныеСравненияРеквизитов = ДанныеДляСравненияКонструктор();
	
	Пока ВыборкаРеквизитов.Следующий() Цикл
		
		ОбъектСравнения = ВыборкаРеквизитов.Спецификация;
		
		ПолеЗначения = "Значение" + Формат(СписокСпецификаций.Индекс(СписокСпецификаций.НайтиПоЗначению(ОбъектСравнения)), "ЧГ=");
		
		ДобавитьРеквизитыСпецификации(ВыборкаРеквизитов, ДанныеСравненияРеквизитов.ТаблицаРеквизитов, ПолеЗначения);
		
	КонецЦикла;
	
	ДанныеСравнения.ДанныеСравнения.Вставить(КлючРеквизитыСпецификаций(), ДанныеСравненияРеквизитов);
	
	// свойства этапов
	
	ТаблицаВыходныхИзделий   = Результат[3].Выгрузить();
	ТаблицаВозвратныхОтходов = Результат[4].Выгрузить();
	ТаблицаВходящихИзделий   = Результат[5].Выгрузить();
	ТаблицаМатериалов        = Результат[6].Выгрузить();
	ТаблицаТрудозатрат       = Результат[7].Выгрузить();
	
	ВыборкаЭтапов = Результат[2].Выбрать();
	Пока ВыборкаЭтапов.Следующий() Цикл
		
		ОбъектСравнения = ВыборкаЭтапов.Спецификация;
		
		КлючЭтапа = ВыборкаЭтапов.КлючЭтапа;
		ПолеЗначения = "Значение" + Формат(СписокСпецификаций.Индекс(СписокСпецификаций.НайтиПоЗначению(ОбъектСравнения)), "ЧГ=");
		
		СтрокаЭтап = ДанныеСравнения.СписокЭтапов.НайтиПоЗначению(КлючЭтапа);
		
		Если СтрокаЭтап = Неопределено Тогда
			
			ПредставлениеЭтапа = Строка(ВыборкаЭтапов.КлючЭтапа) + " (" + ВыборкаЭтапов.СпецификацияПредставление + ")";
			
			ДанныеСравнения.СписокЭтапов.Добавить(КлючЭтапа, ПредставлениеЭтапа);
			
			ДанныеСравненияЭтапа = ДанныеДляСравненияКонструктор();
			
			ДанныеСравнения.ДанныеСравнения.Вставить(КлючЭтапа, ДанныеСравненияЭтапа);
			
			ДанныеСравненияЭтапа.СписокСпецификаций = Новый Массив;
			
		Иначе
			
			ДанныеСравненияЭтапа = ДанныеСравнения.ДанныеСравнения.Получить(КлючЭтапа);
			
		КонецЕсли; 
		
		ДанныеСравненияЭтапа.СписокСпецификаций.Добавить(ОбъектСравнения);
		
		ДобавитьСвойстваЭтапа(ВыборкаЭтапов, ДанныеСравненияЭтапа.ТаблицаСвойств, ПолеЗначения);
		
		Если ВыборкаЭтапов.Многоэтапный Тогда
			СтруктураПоискаДанных = Новый Структура("Спецификация, КлючЭтапа", ВыборкаЭтапов.Спецификация, ВыборкаЭтапов.КлючЭтапа);
		Иначе
			СтруктураПоискаДанных = Новый Структура("Спецификация", ВыборкаЭтапов.Спецификация);
		КонецЕсли;
		
		// ВыходныеИзделия
		ДанныеТЧ = ТаблицаВыходныхИзделий.НайтиСтроки(СтруктураПоискаДанных);
		ДобавитьДанныеПоНоменклатуре(ДанныеТЧ, ДанныеСравненияЭтапа.ТаблицаИзделий, ПолеЗначения);
		
		// ВозвратныеОтходы
		ДанныеТЧ = ТаблицаВозвратныхОтходов.НайтиСтроки(СтруктураПоискаДанных);
		ДобавитьДанныеПоНоменклатуре(ДанныеТЧ, ДанныеСравненияЭтапа.ТаблицаОтходов, ПолеЗначения);
		
		// ВходящиеИзделия
		ДанныеТЧ = ТаблицаВходящихИзделий.НайтиСтроки(СтруктураПоискаДанных);
		ДобавитьДанныеПоНоменклатуре(ДанныеТЧ, ДанныеСравненияЭтапа.ТаблицаВходящихИзделий, ПолеЗначения);
		
		// МатериалыИУслуги
		ДанныеТЧ = ТаблицаМатериалов.НайтиСтроки(СтруктураПоискаДанных);
		ДобавитьДанныеПоНоменклатуре(ДанныеТЧ, ДанныеСравненияЭтапа.ТаблицаМатериалов, ПолеЗначения);
		
		// Трудозатраты
		ДанныеТЧ = ТаблицаТрудозатрат.НайтиСтроки(СтруктураПоискаДанных);
		ДобавитьДанныеПоТрудозатратам(ДанныеТЧ, ДанныеСравненияЭтапа.ТаблицаТрудозатрат, ПолеЗначения);
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСписокСвойств(ТаблицаСвойств, ОбластьСвойстваСтрокаНазвание, ОбластьСвойстваСтрокаИсточник, РезультатСравнения, СписокСпецификаций, ПоказатьТолькоОтличия)
	
	Для каждого ДанныеСвойства Из ТаблицаСвойств Цикл
		Если ПоказатьТолькоОтличия И НЕ ДанныеСвойства.ЕстьОтличия Тогда
			Продолжить;
		КонецЕсли; 
		
		ОбластьСвойстваСтрокаНазвание.Параметры.Свойство = ДанныеСвойства.Свойство;
		ОбластьИсточник = РезультатСравнения.Вывести(ОбластьСвойстваСтрокаНазвание);
		Если НЕ ПоказатьТолькоОтличия И ДанныеСвойства.ЕстьОтличия Тогда
			ОбластьИсточник.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		КонецЕсли; 
		
		Для каждого ЭлКоллекции Из СписокСпецификаций Цикл
			ИмяПоляЗначений = "Значение" + Формат(СписокСпецификаций.Индекс(ЭлКоллекции), "ЧГ="); 
			
			Если ДанныеСвойства.Значения.Свойство(ИмяПоляЗначений) Тогда
				ОбластьСвойстваСтрокаИсточник.Параметры.ЗначениеИсточника = ДанныеСвойства.Значения[ИмяПоляЗначений];
			Иначе
				ОбластьСвойстваСтрокаИсточник.Параметры.ЗначениеИсточника = "";
			КонецЕсли;
			ОбластьИсточник = РезультатСравнения.Присоединить(ОбластьСвойстваСтрокаИсточник);
			Если НЕ ПоказатьТолькоОтличия И ДанныеСвойства.ЕстьОтличия Тогда
				ОбластьИсточник.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			КонецЕсли; 
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ВывестиГруппуСвойств(НазваниеГруппы, ТаблицаСвойств, ОбластьГруппаСвойствНазвание, ОбластьГруппаСвойствИсточник, ОбластьСвойстваСтрокаНазвание, ОбластьСвойстваСтрокаИсточник, РезультатСравнения, СписокСпецификаций, ПоказатьТолькоОтличия)
	
	Если ТаблицаСвойств.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоказатьТолькоОтличия И ТаблицаСвойств.Найти(Истина, "ЕстьОтличия") = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОбластьГруппаСвойствНазвание.Параметры.НазваниеГруппы = НазваниеГруппы;
	РезультатСравнения.Вывести(ОбластьГруппаСвойствНазвание);
	Для каждого ЭлКоллекции Из СписокСпецификаций Цикл
		ОбластьИсточник = РезультатСравнения.Присоединить(ОбластьГруппаСвойствИсточник);
	КонецЦикла;
	ОбластьИсточник.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	РезультатСравнения.НачатьГруппуСтрок(НазваниеГруппы);
	
	ВывестиСписокСвойств(ТаблицаСвойств,
							ОбластьСвойстваСтрокаНазвание,
							ОбластьСвойстваСтрокаИсточник,
							РезультатСравнения,
							СписокСпецификаций,
							ПоказатьТолькоОтличия);
	
	РезультатСравнения.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

Функция КлючРеквизитыСпецификаций()
	
	Возврат "19af7da2-0bd4-4d7f-b5fa-a9897b2edf77";
	
КонецФункции

#КонецОбласти

#КонецЕсли
